In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [3]:
data= pd.read_csv("iplauction2023.csv")

In [4]:
data.head()

,name,player style,nationality,base price (in lacs),final price (in lacs),franchise,status
0,Harshit Rana,Bowler,India,NaN,20.0,KKR,RETAINED
1,Ekant Sen,Batter,India,20.0,NaN,NaN,UNSOLD
2,Wayne Parnell,Allrounder,South Africa,75.0,NaN,NaN,UNSOLD
3,Shakib Al Hasan,Allrounder,Bangladesh,150.0,150.0,KKR,SOLD
4,Joe Root,Batter,England,100.0,100.0,RR,SOLD

In [5]:
data.tail()

,name,player style,nationality,base price (in lacs),final price (in lacs),franchise,status
304,MS Dhoni,WK-Batter,India,NaN,1200.0,CSK,RETAINED
305,Moeen Ali,Allrounder,England,NaN,800.0,CSK,RETAINED
306,Ruturaj Gaikwad,Batter,India,NaN,600.0,CSK,RETAINED
307,Rishabh Pant,WK-Batter,India,NaN,1600.0,DC,RETAINED
308,Axar Patel,Allrounder,India,NaN,900.0,DC,RETAINED

In [7]:
data.columns

Index(['name', 'player style', 'nationality', 'base price (in lacs)',
       'final price (in lacs)', 'franchise', 'status'],
      dtype='object')

In [10]:
data.shape

(309, 7)

In [11]:
data.dtypes

name                      object
player style              object
nationality               object
base price (in lacs)     float64
final price (in lacs)    float64
franchise                 object
status                    object
dtype: object

In [12]:
data.nunique()

name                     309
player style               4
nationality               14
base price (in lacs)       8
final price (in lacs)     67
franchise                 10
status                     3
dtype: int64

In [13]:
data.describe()

       base price (in lacs)  final price (in lacs)
count            151.000000             238.000000
mean              59.205298             368.067227
std               59.688337             449.070117
min               20.000000              20.000000
25%               20.000000              21.250000
50%               20.000000             150.000000
75%               75.000000             625.000000
max              200.000000            1850.000000

# Cleaning the data

In [19]:
d1=data.isnull().sum()
d1

name                       0
player style               0
nationality                0
base price (in lacs)     158
final price (in lacs)     71
franchise                 71
status                     0
dtype: int64

In [17]:
d2=(d1/len(data))*100
d2

name                     0.000000
player style             0.000000
nationality              0.000000
base price (in lacs)     5.355273
final price (in lacs)    2.406484
franchise                2.406484
status                   0.000000
dtype: float64

In [20]:
m=pd.concat([d1,d2],axis=1,keys=['Total','Missing(%)'])
m

                       Total  Missing(%)
name                       0    0.000000
player style               0    0.000000
nationality                0    0.000000
base price (in lacs)     158    5.355273
final price (in lacs)     71    2.406484
franchise                 71    2.406484
status                     0    0.000000